# LightGroup Properties

---
The LightGroup type exposes the following members.
| Name| Description
---|---|---
| Id|  The ElementId of the LightGroup
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  The name of the LightGroup
Top
#### Reference
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace